       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIZZBUZZ.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CNT PIC 9(3) VALUE 1.
       01 WS-DIV1 PIC 9.
       01 WS-DIV2 PIC 9.
       01 WS-MOD1 PIC 9.
       01 WS-MOD2 PIC 9.

       PROCEDURE DIVISION.
           PERFORM L1-LOOP UNTIL WS-CNT = 101.
           STOP RUN.

       L1-LOOP.
DIVIDE WS-CNT BY 3 GIVING WS-DIV1 REMAINDER WS-MOD1.
DIVIDE WS-CNT BY 5 GIVING WS-DIV2 REMAINDER WS-MOD2.
           IF WS-MOD1 = 0 AND WS-MOD2 IS NOT = 0
                   DISPLAY WS-CNT ' FIZZ'.
           IF WS-MOD1 IS NOT = 0 AND WS-MOD2 = 0
                   DISPLAY WS-CNT ' BUZZ'.
           IF WS-MOD1 = 0 AND WS-MOD2 = 0
                   DISPLAY WS-CNT ' FIZZBUZZ'.
           ADD 1 TO WS-CNT.
